### WinEventLog ###
(index=wineventlog EventCode=4688 (process_name=sysmon*.exe (CommandLine=" -u" OR CommandLine=" -u force")) OR (process_name="Sysmon*.exe" process_command_line_arguments="-u" OR process_command_line_arguments="-u force"))

### Sysmon Uninstall ###
(index=winsysmon EventCode=1 process_name=sysmon*.exe (CommandLine="*-u" OR CommandLine="*-u force")) | table  _time CommandLine parent_process parent_process_name parent_process_path process_name process_path process_name NewProcessName process_command_line_process process_command_line_arguments

### Powershell Transcripts ###
index=winpowershell sourcetype="powershell:transcript" "Sysmon* -u" OR "Sysmon* -u force*"

### Powershell ScriptBlockText ###
index=winpowershell source="XmlWinEventLog:Microsoft-Windows-PowerShell/Operational" ScriptBlockText IN ("Sysmon* -u" "./Sysmon* -u" "./Sysmon* -u force" "Sysmon* -u force")

### WinEventlog EventCode 4688 SysmonDrv Unload via fltmc.exe ###
index=wineventlog Channel=Security EventCode=4688  (CommandLine IN ("fltmc.exe  unload SysmonDrv")) OR (process_name=fltMC.exe AND process_command_line_arguments="unload SysmonDrv") | table  _time CommandLine parent_process parent_process_name parent_process_path process_name process_path process_name NewProcessName process_command_line_process process_command_line_arguments

### Sysmon SysmonDrv Unload via fltmc.exe ###

### Sysmon Driver Error ###
index=winsysmon EventCode=255 description="Error occured within Sysmon"


References:
https://www.darkoperator.com/blog/2018/10/5/operating-offensively-against-sysmon
https://github.com/redcanaryco/atomic-red-team/blob/master/atomics/T1562.001/T1562.001.yaml
https://lolbas-project.github.io/lolbas/Binaries/FltMC/
https://github.com/splunk/security_content/blob/18f63553a9dc1a34122fa123deae2b2f9b9ea391/detections/endpoint/scheduled_task_deleted_or_created_via_cmd.yml
